<%@ Page Title="Інформація" Language="C#" MasterPageFile="~/Site.Master" AutoEventWireup="true" CodeBehind="Information.aspx.cs" Inherits="WebApplicationForms.Contact" %>

<asp:Content ID="BodyContent" ContentPlaceHolderID="MainContent" runat="server">

    <div style="font-size: medium" class="inf">
        <h3 align="center">Даний сайт був розроблений як дипломний проект завданням якого є програма діагностики та корегування 
        знань з теми «Методика операції додавання у двійковій системі числення».
        <br />
            <br />
        </h3>
        <h4>&nbsp;&nbsp;&nbsp;&nbsp; Інструкція в користування програмою "Діагностування знань"</h4>
        <p>
            Для початку потрібно перейти на сторінку з даною <a href="FApplication.aspx">програмою</a>, у випадаючому списку вибрати
             тип дій &quot;Арифметичні операціїї&quot;
            <br />
            Поступово здійснити операції переведення двох доданків, починаючи з переведення числа десяткової системи числення 
            у двійкову систему числення в прямому коді, наступним кроком перевести його у зворотній та доповняльний код, 
            здійснити арифметичну операції з даними числами у доповняльному коді, даний результат перевести у зворотній та 
            прямий код, після чого заповнити відповідні поля(відповідь повина бути записана із знаковими розрядами у форматі ##,####, наприклад -9 = 11,1001) та натиснути кнопку &quot;Результат&quot; для того щоб дати 
            відповідь та отримати відповідний результат.
        </p>
        <br />
        <h4>&nbsp;&nbsp;&nbsp;&nbsp; Інструкція в користування калькулятором перевдення систем числення</h4>
        <p>
            Для початку потрібно перейти на сторінку з даним <a href="FApplication.aspx">калькулятором</a>, у випадаючому списку 
            вибрати тип дій &quot;Переведення в с.ч.&quot;
            <br />
            Вибрати з якої в яку систему числення буде проводитись перетворення, ввести число та натиснути кнопку "Перевести"
             задля отримання результату
        </p><br />
        <h4>&nbsp;&nbsp;&nbsp;&nbsp; Інструкція з проходження тестування</h4>
        <p>
            Для початку потрібно перейти на сторінку з даним <a href="Tests.aspx">тестуванням</a>.<br />
             В ході проходження тестування буде задано 10 запитань на які потрібно давати відповідь, правильна відповідь лише одна. 
            Для затвердження відповіді потрібно натиснути по кнопці, після чого вам буде задано інше запитання. При відповіді на 
            які буде виданий результат з кількістю правильних відповідей та дані рекомендації при допущені помилок.
        </p>
    </div>
    <br />
    <address>
        <strong><span style="font-size: large">Контакти:</span></strong><br />
        <strong>email:</strong>   <a href="mailto:rusl.pavlenko@gmail.com">rusl.pavlenko@gmail.com</a><br />
    </address>
</asp:Content>
